using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO
{
    void todo()
    {

        //21.09.2021    
        //убрать надпись в ГУИ "картографич данные гугл"

        //done
        //сделать атвоплей. нажать / убирается
        //заменить картинки на белый с решеткой(заглушка)
        //сделать свайп белых плашек. сделать ограничения верх / низ
        //показать помощь о сканировании
        //заверстить обучение сканирования
        //заменить картинки пинов на карте
        //заменить все круглые картинки на дефолтные
        //заверстать экран описания сценария в объекте
        //придумать, как инициировать видео плеер
        //в карточку маршрута добавить карту
        //инициировать аудио плеер 
        //воспроизводить видео в маске в 3 местах 
        //сделать свайп картинок в описании маршрута и поинта(пагинатор)
        //починить горизонтальный драг вертикальных карт маршрута (2 места)

        //нужно исправить прожимание пинов на карте через интерфейс
        //нашел и применил скрипт определения девайса
        //добавить инерцию при драге белых плашек 

        //27.09

        //done
        //сделать перерсчет лимитов драга для белой плашки, учитывая разрешение экрана
        //сделать кнопки меню(низ экрана) больше
        //тачи попадают по маркерам карты через интерфейс.
        //сделать заглушки для видео треков в горизонт листе  

        //28.09

        //done
        //сделать включение/паузу трека в аудиокнтроллере
        //сделать переход на соотв ячейку с горизонт плейлисте из аудиоконтроллера  

        //01.10   

        //DONE
        //настроить камеру АР, чтобы она не видела карту
        //переделать интерефейс сканера. поменять картинку
        //убрать каску и цветок.сделать куб.
        //добавить переход на маршрут с карточек в разделе "маршрут"
        //в разделе контакты сделать инпутфилд
        //в разделе вопрос/ответ добавить схлоп/расхлоп для заголовков
        //добавить стоп плей в видео плеер

        //REQ
        //новая маска для сканера плохо встала

        //06.10



        //done
        //поменять размер спрайта паузы(плеер)
        //перестали работать маркеры на карте
        //скрыть сканирование маркера, если обнаружен маркер
        //не отображаются пины в АР

        //07.10



        //done
        //прикрутить доп реальность. 

        //08.10



        //done
        //отвязать камеру от ЖПС
        //сделать таскание карты.
        //сделать кнопку позиционирования камеры по маркеру юзера
        //пины в допке перекрываются кубом 
        //отобразить кнопку подробнее при выделении пина в допке

        //11.10



        //done
        //скейлить маркер юзера при зуме карты
        //при зуме карты, маркеры оставляют видимым бэкграунд
        //доделать интерфейс допки    
        //ограничить зум карты
        //настроить лимитеры драгов белых плашек

        //12.10

        //done
        //при зумировании прожимаются маркеры на карте из-за некой средней точки между тачами
        //скроыть помощь о сканированни при выходе из ар
        //при возврате на карту или другой режим. остается камера аркора
        //при повторном сканировании маркеры не читаются

        //25.10
        //пины при маленьком скейле теряют читаемость текста
        //при отдалении от 3д модели. текст глючит кубиками и показывается текст.
        //создаются клоны префабов. 
        //глюки в горизонт плеере. все треки при открытии становятся видео

        //2
        //сделать автопроигрывание всего плейлиста по конкретной точке
        //поработать над стилем карты
        //в разделах меню поднять кнопки, если активен контроллер плеера
        //сделать симуляцию поиска

        //3
        //поискать ассет разных типов вибро 100-150 мсек
        //+вибро  //все горизонт скроллы когда обнаружена новая ячейка
        //+вибро, когда жпс совпали с ПОИ
        //+вибро, когда считывается маркер камерой
        //вкл/выкл вспышки телефона

        //done
        //таскать и зумить камеру в эмбиент сцене
        //добавить шейд смус
        //добавить текстуры корабля


        //04.11
        //включить контроллер плеера при старте приложения

        //добавить в контроллер плеера что-то по умолчанию, если юзер не в ПОИ

        //при открытии маркера на карте.отображается карточка с инфо маркера и в плеер грузится плей лист для этого маркера(ПОИ)

        //


        //18.11

        //done
        //в горизонт драге уменьшить время или дельту драга

        //23.11
        //done
        {
            //добавить контент для сценариев в пои
            //сделать переходы (пои=сценарий - описание) 
            //добавить в маршрут поля для времени экскурсии и кол-ва объектов
            //сделать первую прилагаемую к маршруту картинку его обложкой
            //сделать первую прилагаемую к пои картинку его обложкой(в т.ч. иконка на карте)
            //добавить в маршрут поле для вкл выкл "ар экскурсия"
        }

        //25.11 
        //done
        {
            //добавить чистку пагинаторов в пути и точке для спрайтов в шапке
            //сделать печать существующих маршрутов в разделе "главная"
            //сделать печать существующих пои в разделе "главная"
            //в разделе маршртуов указать параметрику по кол-ву доступных маршрутов в шапке
            //сделать печать существующих пои в разделе "маршруты"
            //сделать печать существующих маршрутов в разделе "маршруты"
            //сбрасывать все драги в изначальное положение при повторном открытии любого раздела
            //сделать переходы (маршрут=пои)
            //сделать переходы (маршрут=описание)
            //сделать процедурную верстку для страницы маршрута
            //сделать смену заголовка в горизонтальном плеере
        }

        //26.11  
        //done
        {
            //сделать функц жпс
            //во всех карточках маршрутов(пои) писать растояние до юзера
            //в разделе маршруты, если нет в радиусе 3км ни одного маршрута - убрать заголовок и плашки
            //сделать вход в пои по жпс. включить плеер. оформить плашку с сообщением о входе в пои
        }

        //29.11

        //30.11
        //проверить слои спрайтов масок в сценариях в АР режиме       

        //добавить в описания(драги) кнопку "наверх"
        //в разделе сканирования отображать контент по сценарию в статичном драге. скроллировать только текст

        //done
        {
            //добавить к маршрутам и пои списки ключей для поиска. проверить регистр
            //реализовать поиск по ключам на главной и в маршрутах
            //сделать вывод достпных по фрагменту ключей под полем поиска
        }

        //02.12.2021
        
       

        //done
        {
            //1)    Гугл карты
            //3)    Отображение плеера -сейчас мини плеер нигде не запускается
            //4)    Убрать кнопку вспышки при старте скана
            //8)    Включить автозапуск растянуть по горизонтали – есть прозрачные пиксели по бокам.
        }

        //03.12       
        
        //6)    Добавить все не кликабельные разделы(дополнить их рыбой)
        //7)    Поправить высоты белых плашек при скроле

        //не переключаются модели на сечение и цельное

        //done
        {
            //10)   При нажатии на плитку ugc зоны происходит выделение строки. Необходимо убрать это выделение. 
            //2)    Отображение контента – картинки текст, 
            //9)    Отступы в выводе маршрутов поиска – уменьшить отступы вверху
            //5)    Сценарная точка – карточка – проверить работу слайдера – картинка уезжает вправо и не возвращается
        }

        //07.12
        //скрол в статичной плашке в АР не скролится. убрать горизонт
        
        //одновременный свайп и драг

        //поискать и прикрутить блюр

        //done
        {
            //при нажатии на сценарий должен начать воспроизводиться соотв трек.
            //"все места" на "главной" показывает главную в "маршрутах"
            //скрыть поиск после перехода
            //увеличить скорость зума на карте в 3-4 раза
            //увелечить пины сценариев в АР в 2 раза
            //минимальный зум на карте увеличить
            //подогнать текст в кнопках "назад к маршруту" и "назад к списку" в карточках маршрута и точки

            //сделать переход на соотв карточку в горизонт плеере из мини плеера
            //миниплеер по умолчанию не переходит в горизонт и не воспроизводит 1-й трек
            //сделать рыбу для маршрутов "мамаев и панарама" чтобы срабатывал переход в маршрут
        }
    }
}
